## Operations

In [12]:
import pandas as pd
import numpy as np

In [14]:
d ={'col1':[1,2,3,4],'col2':[444,555,444,777],'col3':['abc','def','ghi','xyz']}
d

{'col1': [1, 2, 3, 4],
 'col2': [444, 555, 444, 777],
 'col3': ['abc', 'def', 'ghi', 'xyz']}

In [16]:
df = pd.DataFrame(d)

In [18]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   444  ghi
3     4   777  xyz

## Unique values

In [20]:
df['col2'].unique()

array([444, 555, 777], dtype=int64)

In [22]:
## count of unique values
df['col2'].nunique()

3

In [24]:
## Value Counts  # frquency of occurence of a value in a column
df['col2'].value_counts()

col2
444    2
555    1
777    1
Name: count, dtype: int64

## Applying functions

In [27]:
def times2(x):
    return x*2

In [29]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   444  ghi
3     4   777  xyz

In [31]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [33]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [35]:
df['col1'].sum()

10

In [37]:
## Permanent removal of a column
del df['col1'] ## its inplace

In [39]:
df

   col2 col3
0   444  abc
1   555  def
2   444  ghi
3   777  xyz

In [41]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [43]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [45]:
## Sorting operation

In [47]:
df.sort_values('col2')

   col2 col3
0   444  abc
2   444  ghi
1   555  def
3   777  xyz

In [49]:
## is null value present
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [51]:
df.head()

   col2 col3
0   444  abc
1   555  def
2   444  ghi
3   777  xyz

In [53]:
d ={'col1':[1,2,3,4,5,6,7],'col2':[444,555,444,777,333,222,111],'col3':['abc','def','ghi','xyz','bgt','ttt','ccc']}

In [55]:
df = pd.DataFrame(d)

In [57]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   444  ghi
3     4   777  xyz
4     5   333  bgt
5     6   222  ttt
6     7   111  ccc

In [59]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   444  ghi
3     4   777  xyz
4     5   333  bgt

In [61]:
df.tail()

   col1  col2 col3
2     3   444  ghi
3     4   777  xyz
4     5   333  bgt
5     6   222  ttt
6     7   111  ccc

In [63]:
## Data Input & Output in Pandas

In [65]:
df = pd.read_csv('Book1.csv')

In [67]:
df

   A    B    C    D
0  1    s    d    f
1  2    d    f  NaN
2  3  dfg  NaN  NaN
3  4    s    d    f

In [73]:
d ={'col1':[1,2,3,4,5,6,7],'col2':[444,555,444,777,333,222,111],'col3':['abc','def','ghi','xyz','bgt','ttt','ccc']}
df = pd.DataFrame(d)

In [75]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   444  ghi
3     4   777  xyz
4     5   333  bgt
5     6   222  ttt
6     7   111  ccc

In [80]:
df.to_csv('example',index=False)

In [ ]:
## Excel Input
pd.read_excel('ExcelName.xlsx','Sheet1')

In [ ]:
## Excel Output
df.to_excel('ExcelName.xlsx','Sheet1')